### Exercise 1.1.
import data from the 'titanic.csv' file and check its structure.
* passenger_id – Unique passenger id
* pclass – Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)
* survived – Survival (0 = No, 1 = Yes)
* name – Name and SUrname
* sex – Sex (0 = Male, 1 = Female)
* age – Age in years
* sibsp – # of siblings / spouses aboard the Titanic
* parch – # of parents / children aboard the Titanic
* ticket – Ticket number
* fare – Passenger fare
* cabin – Cabin number
* embarked – Port of Embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)
* boat – Lifeboat (if survived)
* body – Body number (if did not survive and body was recovered)
* home.dest – Home/Destination

In [1]:
import pandas as pd
titanic = pd.read_csv("../data/titanic.csv")
titanic.info()

# Check structure of data
titanic.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  1309 non-null   int64
 1   pclass        1309 non-null   int64
 2   survived      1309 non-null   int64
 3   name          1309 non-null   object
 4   sex           1309 non-null   int64
 5   age           1046 non-null   float64
 6   sibsp         1309 non-null   int64
 7   parch         1309 non-null   int64
 8   ticket        1309 non-null   object
 9   fare          1308 non-null   float64
 10  cabin         295 non-null    object
 11  embarked      1307 non-null   object
 12  boat          486 non-null    object
 13  body          121 non-null    float64
 14  home.dest     745 non-null    object
dtypes: float64(3), int64(6), object(6)
memory usage: 153.5+ KB

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,1,"Allen, Miss. Elisabeth Walton",1,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,2,1,1,"Allison, Master. Hudson Trevor",0,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1,0,"Allison, Miss. Helen Loraine",1,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,4,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,5,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Exercise 1.2
In the titanic dataset convert columns with qualitative variables
to factors (sex, embarked, survived) or ordered factor (pclass) -
defining the appropriate levels and, if needed, order of values.
Please code the levels as:
- embarked respectively: Cherbourg, Queenstown, Southampton
- sex - Female, Male
- survived - Yes, No
- pclass - 1st <2nd <3rd

In [2]:
embarked_map = {'C' : 'Cherbourg', 'Q' : 'Queenstown', 'S' : 'Southampton'}
titanic['embarked'] = titanic['embarked'].map(embarked_map)
titanic['embarked'].value_counts()

sex_map = {0 : 'Male', 1 : 'Female'}
titanic['sex'] = titanic['sex'].map(sex_map)
titanic['sex'].value_counts()   

survived_map = {0 : 'No', 1 : 'Yes'}
titanic['survived'] = titanic['survived'].map(survived_map)
titanic['survived'].value_counts()

pclass_map = {1 : '1st', 2 : '2nd', 3 : '3rd'}
titanic['pclass'] = titanic['pclass'].map(pclass_map)
titanic['pclass'].value_counts()

pclass
3rd    709
1st    323
2nd    277
Name: count, dtype: int64

In [3]:
titanic.dtypes

passenger_id      int64
pclass           object
survived         object
name             object
sex              object
age             float64
sibsp             int64
parch             int64
ticket           object
fare            float64
cabin            object
embarked         object
boat             object
body            float64
home.dest        object
dtype: object

READ: https://vimentor.com/en/lesson/tien-xu-ly-du-lieu-trong-linh-vuc-hoc-may-phan-1

In [4]:
titanic.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1st,Yes,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2,NaN,"St Louis, MO"
1,2,1st,Yes,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11,NaN,"Montreal, PQ / Chesterville, ON"
2,3,1st,No,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,4,1st,No,"Allison, Mr. Hudson Joshua Creighton",Male,30.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,5,1st,No,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",Female,25.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,NaN,"Montreal, PQ / Chesterville, ON"